###############################################################################
# Created by write_sdc
# Fri Jun  6 23:52:40 2025
###############################################################################
current_design cve2_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 12.5000 [get_ports {clk_i}]
set_clock_transition 0.2000 [get_clocks {clk_sys}]
set_clock_uncertainty 0.1000 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
create_clock -name clk_jtg -period 20.0000 
set_clock_uncertainty 0.1000 clk_jtg
create_clock -name clk_rtc -period 50.0000 
set_clock_uncertainty 0.1000 clk_rtc
set_clock_groups -name clk_groups_async -asynchronous \
 -group [get_clocks {clk_jtg}]\
 -group [get_clocks {clk_rtc}]\
 -group [get_clocks {clk_sys}]
set_input_delay 2.0000 -rise -max -add_delay [get_ports {rst_ni}]
set_input_delay 2.0000 -fall -max -add_delay [get_ports {rst_ni}]
set_max_delay\
    -from [get_ports {rst_ni}] 12.5000
set_false_path -hold\
    -from [get_ports {rst_ni}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 15.0000 [get_ports {crash_dump_o_64_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_0_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_1_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_0_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_1_}]
set_load -pin_load 15.0000 [get_ports {core_busy_o}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_0_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_100_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_101_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_102_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_103_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_104_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_105_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_106_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_107_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_108_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_109_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_10_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_110_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_111_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_112_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_113_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_114_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_115_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_116_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_117_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_118_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_119_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_11_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_120_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_121_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_122_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_123_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_124_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_125_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_126_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_127_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_12_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_13_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_14_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_15_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_16_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_17_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_18_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_19_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_1_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_20_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_21_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_22_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_23_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_24_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_25_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_26_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_27_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_28_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_29_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_2_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_30_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_31_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_32_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_33_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_34_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_35_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_36_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_37_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_38_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_39_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_3_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_40_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_41_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_42_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_43_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_44_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_45_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_46_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_47_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_48_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_49_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_4_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_50_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_51_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_52_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_53_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_54_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_55_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_56_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_57_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_58_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_59_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_5_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_60_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_61_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_62_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_63_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_65_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_66_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_67_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_68_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_69_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_6_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_70_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_71_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_72_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_73_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_74_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_75_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_76_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_77_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_78_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_79_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_7_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_80_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_81_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_82_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_83_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_84_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_85_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_86_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_87_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_88_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_89_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_8_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_90_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_91_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_92_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_93_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_94_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_95_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_96_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_97_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_98_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_99_}]
set_load -pin_load 15.0000 [get_ports {crash_dump_o_9_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_10_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_11_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_12_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_13_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_14_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_15_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_16_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_17_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_18_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_19_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_20_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_21_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_22_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_23_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_24_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_25_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_26_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_27_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_28_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_29_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_2_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_30_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_31_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_3_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_4_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_5_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_6_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_7_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_8_}]
set_load -pin_load 15.0000 [get_ports {data_addr_o_9_}]
set_load -pin_load 15.0000 [get_ports {data_be_o_0_}]
set_load -pin_load 15.0000 [get_ports {data_be_o_1_}]
set_load -pin_load 15.0000 [get_ports {data_be_o_2_}]
set_load -pin_load 15.0000 [get_ports {data_be_o_3_}]
set_load -pin_load 15.0000 [get_ports {data_req_o}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_0_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_10_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_11_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_12_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_13_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_14_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_15_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_16_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_17_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_18_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_19_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_1_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_20_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_21_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_22_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_23_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_24_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_25_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_26_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_27_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_28_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_29_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_2_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_30_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_31_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_3_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_4_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_5_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_6_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_7_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_8_}]
set_load -pin_load 15.0000 [get_ports {data_wdata_o_9_}]
set_load -pin_load 15.0000 [get_ports {data_we_o}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_10_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_11_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_12_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_13_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_14_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_15_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_16_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_17_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_18_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_19_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_20_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_21_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_22_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_23_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_24_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_25_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_26_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_27_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_28_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_29_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_2_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_30_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_31_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_3_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_4_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_5_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_6_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_7_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_8_}]
set_load -pin_load 15.0000 [get_ports {instr_addr_o_9_}]
set_load -pin_load 15.0000 [get_ports {instr_req_o}]
set_load -pin_load 15.0000 [get_ports {irq_pending_o}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {boot_addr_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_err_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_gnt_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rdata_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_rvalid_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {debug_req_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {fetch_enable_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hart_id_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_err_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_gnt_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rdata_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {instr_rvalid_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_external_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_fast_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_nm_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_software_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {irq_timer_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_en_i}]
###############################################################################
# Design Rules
###############################################################################
