###############################################################################
# Created by write_sdc
# Sun Jun  8 03:52:47 2025
###############################################################################
current_design dm_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 12.5000 [get_ports {clk_i}]
set_clock_transition 0.2000 [get_clocks {clk_sys}]
set_clock_uncertainty 0.1000 clk_sys
set_propagated_clock [get_clocks {clk_sys}]
create_clock -name clk_jtg -period 20.0000 
set_clock_uncertainty 0.1000 clk_jtg
create_clock -name clk_rtc -period 50.0000 
set_clock_uncertainty 0.1000 clk_rtc
set_clock_groups -name clk_groups_async -asynchronous \
 -group [get_clocks {clk_jtg}]\
 -group [get_clocks {clk_rtc}]\
 -group [get_clocks {clk_sys}]
set_input_delay 2.0000 -rise -max -add_delay [get_ports {rst_ni}]
set_input_delay 2.0000 -fall -max -add_delay [get_ports {rst_ni}]
set_max_delay\
    -from [get_ports {rst_ni}] 12.5000
set_false_path -hold\
    -from [get_ports {rst_ni}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 15.0000 [get_ports {debug_req_o}]
set_load -pin_load 15.0000 [get_ports {dmactive_o}]
set_load -pin_load 15.0000 [get_ports {dmi_req_ready_o}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_0_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_10_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_11_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_12_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_13_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_14_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_15_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_16_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_17_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_18_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_19_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_1_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_20_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_21_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_22_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_23_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_24_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_25_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_26_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_27_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_28_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_29_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_2_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_30_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_31_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_32_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_33_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_3_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_4_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_5_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_6_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_7_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_8_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_o_9_}]
set_load -pin_load 15.0000 [get_ports {dmi_resp_valid_o}]
set_load -pin_load 15.0000 [get_ports {master_add_o_0_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_10_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_11_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_12_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_13_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_14_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_15_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_16_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_17_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_18_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_19_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_1_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_20_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_21_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_22_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_23_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_24_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_25_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_26_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_27_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_28_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_29_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_2_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_30_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_31_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_3_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_4_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_5_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_6_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_7_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_8_}]
set_load -pin_load 15.0000 [get_ports {master_add_o_9_}]
set_load -pin_load 15.0000 [get_ports {master_be_o_0_}]
set_load -pin_load 15.0000 [get_ports {master_be_o_1_}]
set_load -pin_load 15.0000 [get_ports {master_be_o_2_}]
set_load -pin_load 15.0000 [get_ports {master_be_o_3_}]
set_load -pin_load 15.0000 [get_ports {master_req_o}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_0_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_10_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_11_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_12_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_13_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_14_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_15_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_16_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_17_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_18_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_19_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_1_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_20_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_21_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_22_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_23_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_24_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_25_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_26_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_27_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_28_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_29_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_2_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_30_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_31_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_3_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_4_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_5_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_6_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_7_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_8_}]
set_load -pin_load 15.0000 [get_ports {master_wdata_o_9_}]
set_load -pin_load 15.0000 [get_ports {master_we_o}]
set_load -pin_load 15.0000 [get_ports {ndmreset_o}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_0_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_10_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_11_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_12_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_13_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_14_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_15_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_16_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_17_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_18_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_19_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_1_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_20_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_21_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_22_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_23_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_24_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_25_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_26_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_27_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_28_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_29_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_2_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_30_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_31_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_3_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_4_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_5_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_6_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_7_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_8_}]
set_load -pin_load 15.0000 [get_ports {slave_rdata_o_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_32_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_33_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_34_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_35_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_36_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_37_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_38_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_39_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_40_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_req_valid_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_resp_ready_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmi_rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {hartinfo_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_gnt_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_err_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_other_err_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_rdata_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {master_r_valid_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ndmreset_ack_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {next_dm_addr_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_addr_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_be_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_be_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_be_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_be_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_req_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_0_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_10_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_11_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_12_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_13_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_14_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_15_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_16_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_17_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_18_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_19_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_1_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_20_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_21_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_22_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_23_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_24_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_25_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_26_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_27_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_28_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_29_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_2_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_30_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_31_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_3_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_4_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_5_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_6_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_7_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_8_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_wdata_i_9_}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {slave_we_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {testmode_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {unavailable_i}]
###############################################################################
# Design Rules
###############################################################################
